photoroid-project/photoroid-backend/app/controllers/boards_controller.rb

    def index
        boards =  Board.all
---
SELECT "user_boards".* FROM "user_boards"

    def create
        board = Board.create(description: params[:description], title: params[:title], media: params[:media])
---
INSERT INTO "boards" ("description", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "I am Home\n"], ["title", "Sean is Home"], ["created_at", "2020-03-26 13:55:08.755082"], ["updated_at", "2020-03-26 13:55:08.755082"]]

    def show
        board = Board.find_by(id: params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]