photoroid-project/photoroid-backend/app/controllers/friend_requests_controller.rb

SELECT "friend_requests".* FROM "friend_requests"
---
    def index
        friend_requests =  FriendRequest.all

INSERT INTO "friend_requests" ("requestor_id", "receiver_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["requestor_id", 4], ["receiver_id", 1], ["status", "pending"], ["created_at", "2020-03-26 13:56:04.564937"], ["updated_at", "2020-03-26 13:56:04.564937"]]
---
      def create
        FriendRequest.create(requestor_id: params[:requestor_id], receiver_id: params[:receiver_id], status: params[:status])

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def show
        friend_requests = FriendRequest.find_by(id: params[:id])

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "friend_requests" WHERE "friend_requests"."id" = ?  [["id", 5]]
---
      def destroy
        friend_request = FriendRequest.find_by(id: params[:id])
        puts("you made it to backend!")
        friend_request.destroy

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "friend_requests" SET "status" = ?, "updated_at" = ? WHERE "friend_requests"."id" = ?  [["status", "accepted"], ["updated_at", "2020-03-26 14:55:04.668938"], ["id", 2]]
---
      def update
        friend_request = FriendRequest.find_by(id: params[:id])
        friend_request.update(status: params[:status])