photoroid-project/photoroid-backend/app/controllers/media_controller.rb

SELECT "media".* FROM "media"
---
    def index
        medias =  Media.all