photoroid-project/photoroid-backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sean"], ["bio", "I am Sean\n"], ["created_at", "2020-03-26 13:54:48.342553"], ["updated_at", "2020-03-26 13:54:48.342553"]]
---
  def create
    user = User.new(name: params[:name], bio: params[:bio])
    if user.valid?
      user.save

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Sean"], ["LIMIT", 1]]
---
  def log_user_in
    user = User.find_by(name: params[:name])