photoroid-project/photoroid-backend/app/controllers/user_boards_controller.rb

    def index
        user_boards =  UserBoard.all
---
SELECT "user_boards".* FROM "user_boards"

    def destroy
        user_board = UserBoard.find_by(id: params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

    def update
        user_board = UserBoard.find_by(id: params[:id])
        user_board.update(status: params[:status])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "user_boards" SET "status" = ?, "updated_at" = ? WHERE "user_boards"."id" = ?  [["status", "active"], ["updated_at", "2020-03-26 14:09:34.140183"], ["id", 27]]

    def show
        user_board = UserBoard.find_by(id: params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]

    def create
        user_board = UserBoard.create(status: params[:status], user_id: params[:user_id], board_id: params[:board_id])
---
INSERT INTO "user_boards" ("status", "user_id", "board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["status", "active"], ["user_id", 4], ["board_id", 20], ["created_at", "2020-03-26 13:55:08.814459"], ["updated_at", "2020-03-26 13:55:08.814459"]]