photoroid-project/photoroid-backend/app/controllers/user_boards_controller.rb

INSERT INTO "user_boards" ("status", "user_id", "board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["status", "active"], ["user_id", 1], ["board_id", 13], ["created_at", "2020-03-24 22:55:42.449601"], ["updated_at", "2020-03-24 22:55:42.449601"]]
---
    def create
        user_board = UserBoard.create(status: params[:status], user_id: session[:user_id], board_id: params[:board_id])